<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"d3c6852450f8498d0e33886b95608e17509b342524e9ff6179e5fcb2c06222dc","plan_job_ref":"Job Plan org changes and list them in a PR #92 at https://github.com/django-commons/membership/actions/runs/15591778882","plan_out_hash":"91bc4895ff8dde1f5a30bdb2d3862044313ae532b5d591644ae1201968674149","plan_hash":"c4b81ac2dd18ea4719332c47e1add54f0654a5611018692b89196e14474f9259","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__
With var files: `terraform/production/org.tfvars
terraform/production/repositories.tfvars
`
With variables: `github_token = (sensitive value)`
<details>
<summary>Plan: 2 to import, 14 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # github_membership.this["asherf"] will be created
+   resource "github_membership" "this" {
+       downgrade_on_destroy = false
+       etag                 = (known after apply)
+       id                   = (known after apply)
+       role                 = "member"
+       username             = "asherf"
    }

  # github_membership.this["korfuri"] will be created
+   resource "github_membership" "this" {
+       downgrade_on_destroy = false
+       etag                 = (known after apply)
+       id                   = (known after apply)
+       role                 = "member"
+       username             = "korfuri"
    }

  # github_membership.this["vinlawz"] will be created
+   resource "github_membership" "this" {
+       downgrade_on_destroy = false
+       etag                 = (known after apply)
+       id                   = (known after apply)
+       role                 = "member"
+       username             = "vinlawz"
    }

  # github_repository.this["django-simple-history"] will be updated in-place
  # (imported from "django-simple-history")
!~  resource "github_repository" "this" {
        allow_auto_merge            = false
        allow_merge_commit          = true
!~      allow_rebase_merge          = true -> false
        allow_squash_merge          = true
!~      allow_update_branch         = false -> true
+       archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
!~      delete_branch_on_merge      = false -> true
!~      description                 = "Store model history and view/revert changes from admin site." -> "Store model history and view/revert changes from admin site. "
        etag                        = "W/\"fa8f30f35862549bb508883b54d4f39614ebe4f50ada290eba2345f18556ddc8\""
        full_name                   = "django-commons/django-simple-history"
        git_clone_url               = "git://github.com/django-commons/django-simple-history.git"
!~      has_discussions             = false -> true
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
!~      has_wiki                    = false -> true
        homepage_url                = "https://django-simple-history.readthedocs.org"
        html_url                    = "https://github.com/django-commons/django-simple-history"
        http_clone_url              = "https://github.com/django-commons/django-simple-history.git"
        id                          = "django-simple-history"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "django-simple-history"
        node_id                     = "****************************"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 1447882
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:django-commons/django-simple-history.git"
        svn_url                     = "https://github.com/django-commons/django-simple-history"
        topics                      = []
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_collaborators.this["django-simple-history"] will be updated in-place
  # (imported from "django-simple-history")
!~  resource "github_repository_collaborators" "this" {
        id             = "django-simple-history"
!~      invitation_ids = {} -> (known after apply)
        repository     = "django-simple-history"

        team {
            permission = "pull"
            team_id    = "*************"
        }
+       team {
+           permission = "admin"
+           team_id    = (known after apply)
        }
+       team {
+           permission = "maintain"
+           team_id    = (known after apply)
        }
+       team {
+           permission = "triage"
+           team_id    = (known after apply)
        }

-       user {
-           permission = "admin" -> null
-           username   = "tim-schilling" -> null
        }
-       user {
-           permission = "push" -> null
-           username   = "ThePumpingLemma" -> null
        }
-       user {
-           permission = "push" -> null
-           username   = "barm" -> null
        }
-       user {
-           permission = "push" -> null
-           username   = "jezdez" -> null
        }
-       user {
-           permission = "push" -> null
-           username   = "kseever" -> null
        }
-       user {
-           permission = "push" -> null
-           username   = "leportella" -> null
        }
-       user {
-           permission = "push" -> null
-           username   = "macro1" -> null
        }
-       user {
-           permission = "push" -> null
-           username   = "rossmechanic" -> null
        }
-       user {
-           permission = "push" -> null
-           username   = "treyhunner" -> null
        }
    }

  # github_repository_environment.pypi["django-simple-history"] will be created
+   resource "github_repository_environment" "pypi" {
+       can_admins_bypass   = true
+       environment         = "pypi"
+       id                  = (known after apply)
+       prevent_self_review = false
+       repository          = "django-simple-history"

+       reviewers {
+           teams = (known after apply)
        }
    }

  # github_repository_environment.testpypi["django-simple-history"] will be created
+   resource "github_repository_environment" "testpypi" {
+       can_admins_bypass   = true
+       environment         = "testpypi"
+       id                  = (known after apply)
+       prevent_self_review = false
+       repository          = "django-simple-history"
    }

  # github_team.repo_admin_team["django-simple-history"] will be created
+   resource "github_team" "repo_admin_team" {
+       create_default_maintainer = false
+       description               = "Admin team for the django-simple-history repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-simple-history-admins"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_committer_team["django-simple-history"] will be created
+   resource "github_team" "repo_committer_team" {
+       create_default_maintainer = false
+       description               = "Committers team for the django-simple-history repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-simple-history-committers"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_team["django-simple-history"] will be created
+   resource "github_team" "repo_team" {
+       create_default_maintainer = false
+       description               = "Main team for the django-simple-history repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-simple-history"
+       node_id                   = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team_members.repo_admin_members["django-simple-history"] will be created
+   resource "github_team_members" "repo_admin_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "maintainer"
+           username = "tim-schilling"
        }
+       members {
+           role     = "member"
+           username = "ddabble"
        }
    }

  # github_team_members.repo_team_members["django-simple-history"] will be created
+   resource "github_team_members" "repo_team_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "maintainer"
+           username = "tim-schilling"
        }
+       members {
+           role     = "member"
+           username = "ddabble"
        }
    }

  # github_team_repository.repo_admin_team_access["django-simple-history"] will be created
+   resource "github_team_repository" "repo_admin_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "admin"
+       repository = "django-simple-history"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_committer_team_access["django-simple-history"] will be created
+   resource "github_team_repository" "repo_committer_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "maintain"
+       repository = "django-simple-history"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_team_access["django-simple-history"] will be created
+   resource "github_team_repository" "repo_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "triage"
+       repository = "django-simple-history"
+       team_id    = (known after apply)
    }

  # github_team_settings.this["django-simple-history"] will be created
+   resource "github_team_settings" "this" {
+       id        = (known after apply)
+       team_id   = (known after apply)
+       team_slug = (known after apply)
+       team_uid  = (known after apply)

+       review_request_delegation {
+           algorithm    = "LOAD_BALANCE"
+           member_count = 2
+           notify       = false
        }
    }

Plan: 2 to import, 14 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan org changes and list them in a PR #92](https://github.com/django-commons/membership/actions/runs/15591778882)